src/cf/Catalogs/инт_ПодписчикиKafka.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПодписчикиKafka</Name>
			<Comment>Подписчики для отправки в Apache Kafka</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эндпоинт</Name>
					<Comment>Kafka брокер (bootstrap servers)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Эндпоинты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТопика</Name>
					<Comment>Имя топика в Kafka</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетнаяОбработка</Name>
					<Comment>Сообщения будут отправлены пакетом в конце обработки потока</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСжатия</Name>
					<Comment>Тип сжатия сообщений (compression.codec для librdkafka)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыСжатияKafka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/инт_ПодписчикиKafka/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////
// инт_ПодписчикиKafka (Модуль менеджера)
// Подписчики для отправки в Apache Kafka
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует сообщение для отправки
//
// Параметры:
//  ДанныеСообщения - Соответствие - Данные для сериализации
//  Подписчик - СправочникСсылка.инт_ПодписчикиKafka - Ссылка на подписчика
//  ИдентификаторСообщения - УникальныйИдентификатор - УИД сообщения
//
// Возвращаемое значение:
//  Строка - Сериализованное сообщение
//
Функция СформироватьСообщение(ДанныеСообщения, Подписчик, ИдентификаторСообщения) Экспорт
    
    // TODO: Поддержка Protobuf, Avro
    Возврат инт_КоннекторHTTP.ОбъектВJson(ДанныеСообщения);
    
КонецФункции

// Отправляет сообщение подписчику
//
// Параметры:
//  Сообщение - Структура - Данные сообщения (ИдентификаторСообщения, Подписчик, СформированноеСообщение)
//  ОтложенныеДействия - Соответствие - Для пакетной обработки
//
Процедура ОтправитьСообщение(Сообщение, ОтложенныеДействия) Экспорт
    
    Подписчик = Сообщение.Подписчик;
    
    Если Подписчик.ПакетнаяОбработка Тогда
        // Накапливаем сообщения для пакетной отправки
        МассивСообщений = ОтложенныеДействия.Получить(Подписчик);
        Если МассивСообщений = Неопределено Тогда
            МассивСообщений = Новый Массив;
            ОтложенныеДействия.Вставить(Подписчик, МассивСообщений);
        КонецЕсли;
        
        СтруктураСообщения = инт_РаботаСКафка.ПолучитьСтруктуруСообщенияДляПакетнойОтправки();
        СтруктураСообщения.message = Сообщение.СформированноеСообщение;
        МассивСообщений.Добавить(СтруктураСообщения);
    Иначе
        ИмяТопика = Подписчик.ИмяТопика;
        Брокеры = Подписчик.Эндпоинт.АдресРесурса;
        ТипСжатия = Подписчик.ТипСжатия;
        
        инт_РаботаСКафка.ОтправитьСообщение(Сообщение.СформированноеСообщение, Брокеры, ИмяТопика, , , , ТипСжатия);
    КонецЕсли;
    
КонецПроцедуры

// Отправка накопленного пакета (вызывается в конце обработки потока)
//
// Параметры:
//  Подписчик - СправочникСсылка.инт_ПодписчикиKafka - Подписчик
//  МассивСообщений - Массив - Накопленные сообщения
//
Процедура ОтправитьПакет(Подписчик, МассивСообщений) Экспорт
    
    Брокеры = Подписчик.Эндпоинт.АдресРесурса;
    ТипСжатия = Подписчик.ТипСжатия;
    инт_РаботаСКафка.ОтправитьСообщенияПакетом(МассивСообщений, Брокеры, Подписчик.ИмяТопика, ТипСжатия);
    
КонецПроцедуры

#КонецОбласти
